application/blogger/app/controllers/admin/categories_controller.rb

  def create
    @category = Category.save_data category_params
---
INSERT INTO `categories` (`created_at`, `name`, `updated_at`) VALUES ('2014-12-22 05:37:46', 'Animal', '2014-12-22 05:37:46')

  def update
    @category = Category.save_data category_params
---
INSERT INTO `categories` (`created_at`, `name`, `updated_at`) VALUES ('2014-12-22 06:01:25', 'Animals', '2014-12-22 06:01:25')
UPDATE `categories` SET `name` = 'Animaldd', `updated_at` = '2014-12-22 06:02:07' WHERE `categories`.`id` = 1

  def destroy
    get_by_id params[:id]
    if @category.delete
---
DELETE FROM `categories` WHERE `categories`.`id` = 2