application/blogger/app/controllers/admin/posts_controller.rb

  def create
    @post = Post.save_data post_params, current_user
---
INSERT INTO `posts` (`category_id`, `content`, `created_at`, `slug`, `title`, `updated_at`) VALUES (3, '<p>adsads</p>', '2014-12-22 06:33:04', 'asdasd', 'asdasd', '2014-12-22 06:33:04')

  def update
    @post = Post.save_data post_params, current_user
---
UPDATE `posts` SET `title` = 'Training Your Dogss', `updated_at` = '2014-12-22 06:00:37' WHERE `posts`.`id` = 2

  def destroy
    get_by_id params[:id]
    if @post.delete
---
DELETE FROM `posts` WHERE `posts`.`id` = 2