application/blogger/app/controllers/home_controller.rb

  def index
    @post = Post.last
---
SELECT  `posts`.* FROM `posts`   ORDER BY `posts`.`id` DESC LIMIT 1