application/blogger/app/controllers/tinymce_assets_controller.rb

INSERT INTO `images` (`created_at`, `file_content_type`, `file_file_name`, `file_file_size`, `file_updated_at`, `updated_at`) VALUES ('2014-12-22 03:48:42', 'image/png', 'Screenshot_from_2014-12-17_13_31_43.png', 180857, '2014-12-22 03:48:42', '2014-12-22 03:48:42')
---
  def create
    geometry = Paperclip::Geometry.from_file params[:file]
    image = Image.create params.permit(:file, :alt, :hint)